Rhino.Inside.Revit API
GeometryDecoder.ToGeometryBase Method
 Converts the specified GeomertyObject to an equivalent Revit GeometryBase object.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static Rhino.Geometry.GeometryBase ToGeometryBase(
	this Autodesk.Revit.DB.GeometryObject value
)
@staticmethod
def ToGeometryBase(
	value: Autodesk.Revit.DB.GeometryObject
) -> Rhino.Geometry.GeometryBase
Parameters
value
Type: Autodesk.Revit.DB.GeometryObject
A value to convert.
Return Value
Type: Rhino.Geometry.GeometryBase
A Rhino GeometryBase object that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.GeometryObject. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace